espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFM32TG11B/Include/efm32tg11b_can.h
/***************************************************************************//**
 * @file
 * @brief EFM32TG11B_CAN register and bit field definitions
 *******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#if defined(__ICCARM__)
#pragma system_include       /* Treat file as system include file. */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang system_header  /* Treat file as system include file. */
#endif

/***************************************************************************//**
 * @addtogroup Parts
 * @{
 ******************************************************************************/
/***************************************************************************//**
 * @defgroup EFM32TG11B_CAN CAN
 * @{
 * @brief EFM32TG11B_CAN Register Declaration
 ******************************************************************************/
/** CAN Register Declaration */
typedef struct {
  __IOM uint32_t  CTRL;          /**< Control Register  */
  __IOM uint32_t  STATUS;        /**< Status Register  */
  __IM uint32_t   ERRCNT;        /**< Error Count Register  */
  __IOM uint32_t  BITTIMING;     /**< Bit Timing Register  */
  __IM uint32_t   INTID;         /**< Interrupt Identification Register  */
  __IOM uint32_t  TEST;          /**< Test Register  */
  __IOM uint32_t  BRPE;          /**< BRP Extension Register  */
  __IM uint32_t   TRANSREQ;      /**< Transmission Request Register  */
  __IM uint32_t   MESSAGEDATA;   /**< New Data Register  */

  uint32_t        RESERVED0[1U]; /**< Reserved for future use **/
  __IM uint32_t   MESSAGESTATE;  /**< Message Valid Register  */
  __IOM uint32_t  CONFIG;        /**< Configuration Register  */
  __IM uint32_t   IF0IF;         /**< Message Object Interrupt Flag Register  */
  __IOM uint32_t  IF0IFS;        /**< Message Object Interrupt Flag Set Register  */
  __IOM uint32_t  IF0IFC;        /**< Message Object Interrupt Flag Clear Register  */
  __IOM uint32_t  IF0IEN;        /**< Message Object Interrupt Enable Register  */
  __IM uint32_t   IF1IF;         /**< Status Interrupt Flag Register  */
  __IOM uint32_t  IF1IFS;        /**< Message Object Interrupt Flag Set Register  */
  __IOM uint32_t  IF1IFC;        /**< Message Object Interrupt Flag Clear Register  */
  __IOM uint32_t  IF1IEN;        /**< Status Interrupt Enable Register  */
  __IOM uint32_t  ROUTE;         /**< I/O Routing Register  */

  uint32_t        RESERVED1[3U]; /**< Reserved registers */
  CAN_MIR_TypeDef MIR[2U];       /**< Interface Registers */
} CAN_TypeDef;                   /** @} */

/***************************************************************************//**
 * @addtogroup EFM32TG11B_CAN
 * @{
 * @defgroup EFM32TG11B_CAN_BitFields CAN Bit Fields
 * @{
 ******************************************************************************/

/* Bit fields for CAN CTRL */
#define _CAN_CTRL_RESETVALUE                     0x00000001UL                  /**< Default value for CAN_CTRL */
#define _CAN_CTRL_MASK                           0x000000EFUL                  /**< Mask for CAN_CTRL */
#define CAN_CTRL_INIT                            (0x1UL << 0)                  /**< Initialize */
#define _CAN_CTRL_INIT_SHIFT                     0                             /**< Shift value for CAN_INIT */
#define _CAN_CTRL_INIT_MASK                      0x1UL                         /**< Bit mask for CAN_INIT */
#define _CAN_CTRL_INIT_DEFAULT                   0x00000001UL                  /**< Mode DEFAULT for CAN_CTRL */
#define CAN_CTRL_INIT_DEFAULT                    (_CAN_CTRL_INIT_DEFAULT << 0) /**< Shifted mode DEFAULT for CAN_CTRL */
#define CAN_CTRL_IE                              (0x1UL << 1)                  /**< Module Interrupt Enable */
#define _CAN_CTRL_IE_SHIFT                       1                             /**< Shift value for CAN_IE */
#define _CAN_CTRL_IE_MASK                        0x2UL                         /**< Bit mask for CAN_IE */
#define _CAN_CTRL_IE_DEFAULT                     0x00000000UL                  /**< Mode DEFAULT for CAN_CTRL */
#define CAN_CTRL_IE_DEFAULT                      (_CAN_CTRL_IE_DEFAULT << 1)   /**< Shifted mode DEFAULT for CAN_CTRL */
#define CAN_CTRL_SIE                             (0x1UL << 2)                  /**< Status Change Interrupt Enable */
#define _CAN_CTRL_SIE_SHIFT                      2                             /**< Shift value for CAN_SIE */
#define _CAN_CTRL_SIE_MASK                       0x4UL                         /**< Bit mask for CAN_SIE */
#define _CAN_CTRL_SIE_DEFAULT                    0x00000000UL                  /**< Mode DEFAULT for CAN_CTRL */
#define CAN_CTRL_SIE_DEFAULT                     (_CAN_CTRL_SIE_DEFAULT << 2)  /**< Shifted mode DEFAULT for CAN_CTRL */
#define CAN_CTRL_EIE                             (0x1UL << 3)                  /**< Error Interrupt Enable */
#define _CAN_CTRL_EIE_SHIFT                      3                             /**< Shift value for CAN_EIE */
#define _CAN_CTRL_EIE_MASK                       0x8UL                         /**< Bit mask for CAN_EIE */
#define _CAN_CTRL_EIE_DEFAULT                    0x00000000UL                  /**< Mode DEFAULT for CAN_CTRL */
#define CAN_CTRL_EIE_DEFAULT                     (_CAN_CTRL_EIE_DEFAULT << 3)  /**< Shifted mode DEFAULT for CAN_CTRL */
#define CAN_CTRL_DAR                             (0x1UL << 5)                  /**< Disable Automatic Retransmission */
#define _CAN_CTRL_DAR_SHIFT                      5                             /**< Shift value for CAN_DAR */
#define _CAN_CTRL_DAR_MASK                       0x20UL                        /**< Bit mask for CAN_DAR */
#define _CAN_CTRL_DAR_DEFAULT                    0x00000000UL                  /**< Mode DEFAULT for CAN_CTRL */
#define CAN_CTRL_DAR_DEFAULT                     (_CAN_CTRL_DAR_DEFAULT << 5)  /**< Shifted mode DEFAULT for CAN_CTRL */
#define CAN_CTRL_CCE                             (0x1UL << 6)                  /**< Configuration Change Enable */
#define _CAN_CTRL_CCE_SHIFT                      6                             /**< Shift value for CAN_CCE */
#define _CAN_CTRL_CCE_MASK                       0x40UL                        /**< Bit mask for CAN_CCE */
#define _CAN_CTRL_CCE_DEFAULT                    0x00000000UL                  /**< Mode DEFAULT for CAN_CTRL */
#define CAN_CTRL_CCE_DEFAULT                     (_CAN_CTRL_CCE_DEFAULT << 6)  /**< Shifted mode DEFAULT for CAN_CTRL */
#define CAN_CTRL_TEST                            (0x1UL << 7)                  /**< Test Mode Enable Write */
#define _CAN_CTRL_TEST_SHIFT                     7                             /**< Shift value for CAN_TEST */
#define _CAN_CTRL_TEST_MASK                      0x80UL                        /**< Bit mask for CAN_TEST */
#define _CAN_CTRL_TEST_DEFAULT                   0x00000000UL                  /**< Mode DEFAULT for CAN_CTRL */
#define CAN_CTRL_TEST_DEFAULT                    (_CAN_CTRL_TEST_DEFAULT << 7) /**< Shifted mode DEFAULT for CAN_CTRL */

